package Loops;

public class LoopsTask3 {
    public static void main(String[] args) {
        for (int i = 7; i <= 98; i+=7) {
            System.out.print(i + " ");
        }
    }
}

//Задача 3. Вывести на консоль последовательность чисел: 7 14 21 28 35 42 49 56 63 70 77 84 91 98.
// Использовать циклы.
