package Arrays;

public class ArraysTask2 {
    public static void main(String[] args) {
        String[] weekDays = new String[]{"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"};
        System.out.println(weekDays[weekDays.length-1]);
    }
}

//Задача 2. Создать массив типа String с размером 7.
// Записать в него значения дней недели.
// Вывести на консоль значение последнего элемента.